      * ----------------------------------------------------------- *
      * Description                                                 *
      * ----------------------------------------------------------- *
      *                                                             *
      * File .......: OMCRNL1                                       *
      * Module .....: HelpDesk                                      *
      * Function ...: Customer renames logical                      *
      * Author .....: Remain Software                               *
      *                                                             *
      * ----------------------------------------------------------- *

      * ----------------------------------------------------------- *
      * Record OMCRNL                                               *
      * ----------------------------------------------------------- *
                                            UNIQUE
     A          R OMCRNR                    PFILE(OMCRN)

      * ----------------------------------------------------------- *
      * Access path                                                 *
      * RNCUSC      - Customer Code                                 *
      * ----------------------------------------------------------- *
     A          K RNCUSC
