 /* ---------------------------------------------------------------- */
 /* Description                                                      */
 /* ---------------------------------------------------------------- */
 /*                                                                  */
 /* Program ....: OMH037C                                            */
 /* Function ...: Receive distributions                              */
 /* Author .....: Remain Software                                    */
 /* Parameter ..: &USRI  - SNADS user id                             */
 /*               &ADDR  - SNADS address                             */
 /*               &STAT  - Status                                    */
 /*                                                                  */
 /* This program receives the distributions for a given user and     */
 /* processes them.                                                  */
 /*                                                                  */
 /* ---------------------------------------------------------------- */

             PGM        PARM(&USRI &ADDR &STAT)

 /* ---------------------------------------------------------------- */
 /* Parameters                                                       */
 /* ---------------------------------------------------------------- */
             DCL        VAR(&USRI) TYPE(*CHAR) LEN(8)
             DCL        VAR(&ADDR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(5)

 /* ---------------------------------------------------------------- */
 /* Variables                                                        */
 /* ---------------------------------------------------------------- */
             DCL        VAR(&MSGD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(4) +
                          VALUE(X'00000000')

 /* ---------------------------------------------------------------- */
 /* Files                                                            */
 /* ---------------------------------------------------------------- */
             DCLF       FILE(OMDIQ)

 /* ---------------------------------------------------------------- */
 /* Install global error monitor                                     */
 /* ---------------------------------------------------------------- */
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

 /* ---------------------------------------------------------------- */
 /* Check if there are distributions for this user.                  */
 /* ---------------------------------------------------------------- */
             QRYDST     USRID(&USRI &ADDR)
             RCVMSG     MSGDTA(&MSGD)
             IF         COND(&MSGD *NE &NULL) THEN(DO)

 /* ---------------------------------------------------------------- */
 /* Receive the distributions in a file                              */
 /* ---------------------------------------------------------------- */
             DLTF       FILE(QTEMP/OMDIQ)
             MONMSG     MSGID(CPF0000)

             QRYDST     USRID(&USRI &ADDR) OUTFILE(QTEMP/OMDIQ)

          /* ------------------------------------------------------ */
          /* Read that file and get the data in OMERF               */
          /* ------------------------------------------------------ */
             DLTF       FILE(QTEMP/OMERF)
             MONMSG     MSGID(CPF0000)

             OVRDBF     FILE(OMDIQ) TOFILE(QTEMP/OMDIQ)

             RCVF
             RCVDST     DSTID(&LINDID) USRID(&USRI &ADDR) +
                          OUTFILE(QTEMP/OMERF) OUTDTATYP(*DOC)

 MH03710:    RCVF
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(LEAVE10))
             RCVDST     DSTID(&LINDID) USRID(&USRI &ADDR) +
                          OUTFILE(QTEMP/OMERF) OUTMBR(*FIRST *ADD) +
                          OUTDTATYP(*DOC)
             GOTO       CMDLBL(MH03710)


 LEAVE10:
          /* ------------------------------------------------------ */
          /* Remove the userspace                                   */
          /* ------------------------------------------------------ */
             DLTUSRSPC  USRSPC(QTEMP/OMH037)
             MONMSG     MSGID(CPF0000)

          /* ------------------------------------------------------ */
          /* OMERF read, fill the HelpDesk files                    */
          /* ------------------------------------------------------ */
             OVRDBF     FILE(OMERF) TOFILE(QTEMP/OMERF)
             CALL       PGM(OMH037) PARM('1' &STAT)

             ENDDO


 /* ---------------------------------------------------------------- */
 /* Goto end of program                                              */
 /* ---------------------------------------------------------------- */
             GOTO       CMDLBL(ENDPGM)

 /* ---------------------------------------------------------------- */
 /* Handle unexpected errors                                         */
 /* ---------------------------------------------------------------- */
 ERROR:
             CHGVAR     VAR(&STAT) VALUE('*TERM')

 /* ---------------------------------------------------------------- */
 /* Exit program processing                                          */
 /* ---------------------------------------------------------------- */
 ENDPGM:     RMVMSG     CLEAR(*ALL)

             ENDPGM
