 /* ---------------------------------------------------------------- */
 /* Description                                                      */
 /* ---------------------------------------------------------------- */
 /*                                                                  */
 /* Program ....: OMH040C                                            */
 /* Function ...: Call OMH040                                        */
 /* Author .....: Remain Software                                    */
 /* Parameters .: HEDC, STAT                                         */
 /*                                                                  */
 /* This is the CCP for MHX maintenance                              */
 /*                                                                  */
 /* ---------------------------------------------------------------- */

             PGM        PARM(&HEDC &STAT)

 /* ---------------------------------------------------------------- */
 /* Declare parameter-variables                                      */
 /* ---------------------------------------------------------------- */
             DCL        VAR(&HEDC) TYPE(*CHAR) LEN(5)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(5)
             CHGVAR     VAR(&STAT) VALUE('*NORM')

 /* ---------------------------------------------------------------- */
 /* Install global error monitor                                     */
 /* ---------------------------------------------------------------- */
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

 /* ---------------------------------------------------------------- */
 /* Determine HelpDesk code                                          */
 /* ---------------------------------------------------------------- */
             IF         COND(&HEDC *EQ ' ') THEN(DO)
             CALL       PGM(OMH029) PARM('3' &HEDC ' ' ' ' ' ' ' ')
             ENDDO

 /* ---------------------------------------------------------------- */
 /* Call the maintenance program                                     */
 /* ---------------------------------------------------------------- */
             CALL       PGM(OMH040) PARM(&HEDC &STAT)
             IF         COND(&STAT *EQ '*TERM') THEN(GOTO +
                          CMDLBL(ERROR))

 /* ---------------------------------------------------------------- */
 /* Program ends normally                                            */
 /* ---------------------------------------------------------------- */
             ELSE       CMD(GOTO CMDLBL(ENDPGM))

 /* ---------------------------------------------------------------- */
 /* Handle unexpected errors                                         */
 /* ---------------------------------------------------------------- */
 ERROR:
             CHGVAR     VAR(&STAT) VALUE('*TERM')
             SNDPGMMSG  MSGID(OMQ5012) MSGF(OMSAPI) +
                          MSGDTA(STRHXM) MSGTYPE(*ESCAPE)

 /* ---------------------------------------------------------------- */
 /* Exit program processing.                                         */
 /* ---------------------------------------------------------------- */
 ENDPGM:
             RMVMSG     CLEAR(*ALL)
             RETURN
             ENDPGM
